#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/manning1142025/learn-terraform-github-actions/runs/run-NdvTkdXTLxZtzxHL

Waiting for the plan to start...

Terraform v1.10.4
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ec2_transit_gateway.CloudMaraduers_TGW will be created
  + resource "aws_ec2_transit_gateway" "CloudMaraduers_TGW" {
      + amazon_side_asn                    = 64512
      + arn                                = (known after apply)
      + association_default_route_table_id = (known after apply)
      + auto_accept_shared_attachments     = "disable"
      + default_route_table_association    = "enable"
      + default_route_table_propagation    = "enable"
      + dns_support                        = "enable"
      + id                                 = (known after apply)
      + multicast_support                  = "disable"
      + owner_id                           = (known after apply)
      + propagation_default_route_table_id = (known after apply)
      + security_group_referencing_support = "enable"
      + tags                               = {
          + "Name" = "CloudMaraduers-TGW"
        }
      + tags_all                           = {
          + "Name" = "CloudMaraduers-TGW"
        }
      + vpn_ecmp_support                   = "enable"
    }

  # aws_ec2_transit_gateway_vpc_attachment.dev_attachment will be created
  + resource "aws_ec2_transit_gateway_vpc_attachment" "dev_attachment" {
      + appliance_mode_support                          = "disable"
      + dns_support                                     = "enable"
      + id                                              = (known after apply)
      + ipv6_support                                    = "disable"
      + security_group_referencing_support              = "disable"
      + subnet_ids                                      = (known after apply)
      + tags_all                                        = (known after apply)
      + transit_gateway_default_route_table_association = (known after apply)
      + transit_gateway_default_route_table_propagation = (known after apply)
      + transit_gateway_id                              = (known after apply)
      + vpc_id                                          = (known after apply)
      + vpc_owner_id                                    = (known after apply)
    }

  # aws_ec2_transit_gateway_vpc_attachment.prod_attachment will be created
  + resource "aws_ec2_transit_gateway_vpc_attachment" "prod_attachment" {
      + appliance_mode_support                          = "disable"
      + dns_support                                     = "enable"
      + id                                              = (known after apply)
      + ipv6_support                                    = "disable"
      + security_group_referencing_support              = "disable"
      + subnet_ids                                      = (known after apply)
      + tags_all                                        = (known after apply)
      + transit_gateway_default_route_table_association = (known after apply)
      + transit_gateway_default_route_table_propagation = (known after apply)
      + transit_gateway_id                              = (known after apply)
      + vpc_id                                          = (known after apply)
      + vpc_owner_id                                    = (known after apply)
    }

  # aws_ec2_transit_gateway_vpc_attachment.test_attachment will be created
  + resource "aws_ec2_transit_gateway_vpc_attachment" "test_attachment" {
      + appliance_mode_support                          = "disable"
      + dns_support                                     = "enable"
      + id                                              = (known after apply)
      + ipv6_support                                    = "disable"
      + security_group_referencing_support              = "disable"
      + subnet_ids                                      = (known after apply)
      + tags_all                                        = (known after apply)
      + transit_gateway_default_route_table_association = (known after apply)
      + transit_gateway_default_route_table_propagation = (known after apply)
      + transit_gateway_id                              = (known after apply)
      + vpc_id                                          = (known after apply)
      + vpc_owner_id                                    = (known after apply)
    }

  # aws_instance.dev-basiclinux will be created
  + resource "aws_instance" "dev-basiclinux" {
      + ami                                  = "ami-037774efca2da0726"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "basiclinux"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"  = "dev-basiclinux"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "dev"
        }
      + tags_all                             = {
          + "Name"  = "dev-basiclinux"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "dev"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_instance.prod-basicmicrosoft will be created
  + resource "aws_instance" "prod-basicmicrosoft" {
      + ami                                  = "ami-0c808db6baea2d0ed"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "CloudMaraduers-prod-A-winBastion01"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"  = "prod-basicmicrosoft"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "prod"
        }
      + tags_all                             = {
          + "Name"  = "prod-basicmicrosoft"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "prod"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_instance.testing-basiclinux will be created
  + resource "aws_instance" "testing-basiclinux" {
      + ami                                  = "ami-037774efca2da0726"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "basiclinux"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"  = "testing-basiclinux"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "test"
        }
      + tags_all                             = {
          + "Name"  = "testing-basiclinux"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "test"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"  = "CloudMaraduers-Prod"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "prod"
        }
      + tags_all = {
          + "Name"  = "CloudMaraduers-Prod"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "prod"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route.dev_route_to_prod will be created
  + resource "aws_route" "dev_route_to_prod" {
      + destination_cidr_block = "172.16.0.0/16"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
      + transit_gateway_id     = (known after apply)
    }

  # aws_route.prod_public_route_internet will be created
  + resource "aws_route" "prod_public_route_internet" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.prod_route_to_dev will be created
  + resource "aws_route" "prod_route_to_dev" {
      + destination_cidr_block = "172.88.0.0/16"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
      + transit_gateway_id     = (known after apply)
    }

  # aws_route.prod_route_to_test will be created
  + resource "aws_route" "prod_route_to_test" {
      + destination_cidr_block = "172.52.0.0/16"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
      + transit_gateway_id     = (known after apply)
    }

  # aws_route.test_route_to_prod will be created
  + resource "aws_route" "test_route_to_prod" {
      + destination_cidr_block = "172.16.0.0/16"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
      + transit_gateway_id     = (known after apply)
    }

  # aws_route_table.dev_route_table will be created
  + resource "aws_route_table" "dev_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"  = "CloudMaraduers-Dev-Route-Table"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "dev"
        }
      + tags_all         = {
          + "Name"  = "CloudMaraduers-Dev-Route-Table"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "dev"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.prod_public_route_table will be created
  + resource "aws_route_table" "prod_public_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"  = "CloudMaraduers-Prod-Public-Route-Table"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "prod"
        }
      + tags_all         = {
          + "Name"  = "CloudMaraduers-Prod-Public-Route-Table"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "prod"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.prod_route_table will be created
  + resource "aws_route_table" "prod_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"  = "CloudMaraduers-Prod-Route-Table"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "prod"
        }
      + tags_all         = {
          + "Name"  = "CloudMaraduers-Prod-Route-Table"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "prod"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.test_route_table will be created
  + resource "aws_route_table" "test_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"  = "CloudMaraduers-Test-Route-Table"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "test"
        }
      + tags_all         = {
          + "Name"  = "CloudMaraduers-Test-Route-Table"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "test"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.prod_public_subnet_association will be created
  + resource "aws_route_table_association" "prod_public_subnet_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.Dev-C-basiclinux-SG will be created
  + resource "aws_security_group" "Dev-C-basiclinux-SG" {
      + arn                    = (known after apply)
      + description            = "Allow SSH, ICMP and HTTP "
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.0.0.0/8",
                ]
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "172.0.0.0/8",
                ]
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "172.0.0.0/8",
                ]
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Owner" = "CloudMaraduers"
          + "name"  = "Dev-C-basiclinux-SG"
          + "ring"  = "dev"
        }
      + tags_all               = {
          + "Owner" = "CloudMaraduers"
          + "name"  = "Dev-C-basiclinux-SG"
          + "ring"  = "dev"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.Production-A-basicmicrosoft-SG will be created
  + resource "aws_security_group" "Production-A-basicmicrosoft-SG" {
      + arn                    = (known after apply)
      + description            = "Allow RDP "
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 3389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3389
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"  = "Production-A-basicmicrosoft-SG"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "Prod"
        }
      + tags_all               = {
          + "Name"  = "Production-A-basicmicrosoft-SG"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "Prod"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.Testing-B-basiclinux-SG will be created
  + resource "aws_security_group" "Testing-B-basiclinux-SG" {
      + arn                    = (known after apply)
      + description            = "Allow SSH, ICMP and HTTP"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.0.0.0/8",
                ]
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "172.0.0.0/8",
                ]
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "172.0.0.0/8",
                ]
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"  = "Testing-B-basiclinux-SG"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "Test"
        }
      + tags_all               = {
          + "Name"  = "Testing-B-basiclinux-SG"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "Test"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.Development-C-Private will be created
  + resource "aws_subnet" "Development-C-Private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.88.13.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"  = "CloudMaraduers-Dev-Private"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "dev"
        }
      + tags_all                                       = {
          + "Name"  = "CloudMaraduers-Dev-Private"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "dev"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.Production-A-Private will be created
  + resource "aws_subnet" "Production-A-Private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"  = "CloudMaraduers-Prod-Private"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "prod"
        }
      + tags_all                                       = {
          + "Name"  = "CloudMaraduers-Prod-Private"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "prod"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.Production-A-Pub will be created
  + resource "aws_subnet" "Production-A-Pub" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"  = "CloudMaraduers-Prod-Public"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "prod"
        }
      + tags_all                                       = {
          + "Name"  = "CloudMaraduers-Prod-Public"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "prod"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.Testing-B-Private will be created
  + resource "aws_subnet" "Testing-B-Private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.52.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"  = "CloudMaraduers-Test-Private"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "test"
        }
      + tags_all                                       = {
          + "Name"  = "CloudMaraduers-Test-Private"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "test"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.CloudMaraduers-Dev will be created
  + resource "aws_vpc" "CloudMaraduers-Dev" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.88.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"  = "CloudMaraduers-Dev"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "dev"
        }
      + tags_all                             = {
          + "Name"  = "CloudMaraduers-Dev"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "dev"
        }
    }

  # aws_vpc.CloudMaraduers-Prod will be created
  + resource "aws_vpc" "CloudMaraduers-Prod" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.16.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"  = "CloudMaraduers-Prod"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "prod"
        }
      + tags_all                             = {
          + "Name"  = "CloudMaraduers-Prod"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "prod"
        }
    }

  # aws_vpc.CloudMaraduers-Test will be created
  + resource "aws_vpc" "CloudMaraduers-Test" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.52.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"  = "CloudMaraduers-Test"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "test"
        }
      + tags_all                             = {
          + "Name"  = "CloudMaraduers-Test"
          + "Owner" = "CloudMaraduers"
          + "ring"  = "test"
        }
    }

Plan: 28 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + dev_vpc_id  = (known after apply)
  + prod_vpc_id = (known after apply)
  + test_vpc_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ChaManRoRo, Action: `pull_request`*